Revit 2026 API

# RebarContainerItemGetBarPositionTransform Method

---

Return a transform representing the relative position of any individual bar in the set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetBarPositionTransform(
	int barPositionIndex
)
```
```vb
Public Function GetBarPositionTransform (
	barPositionIndex As Integer
) As Transform
```
```cpp
public:
Transform^ GetBarPositionTransform(
	int barPositionIndex
)
```
```fsharp
member GetBarPositionTransform :
        barPositionIndex : int -> Transform
```

#### Parameters

barPositionIndex Int32
     An index between 0 and (NumberOfBarPositions-1).

#### Return Value

Transform The position of a bar in the set relative to the first position.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |

The transform is a translation along the distribution path. It can be applied to the results of GetCenterlineCurves() to produce any bar in the rebar set. For barPositionIndex=0, the identity transform is always returned.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace